# 2) თქვენი სიტყვებით ახსენით თუ რატომ ვიყენებთ ფუნქციებს პითონში.
# ფუნქციები გვაძლევს კოდების ორგანიზების საშუალებას, რაც ამარტივებს კოდის წაკითხვას და გამართვას.

# 3) გადახედეთ რესურსს პითონის ფუნქციების შესახებ:
# https://www.w3schools.com/python/python_functions.asp

# 4) შექმენით ფუნქცია, რომელიც არგუმენტად მიიღებს მომხმარებლის სახელსა და ასაკს. ფუნქციამ უნდა დააბრუნოს მსგავსი წინადადება:
# "მომხმარებლის სახელი" არის "მომხმარებლის ასაკი" წლის.
def user_info(name, age):
    return f"{name} არის {age} წლის."


# 5) შექმენით ფუნქცია, რომელიც არგუმენტად მიიღებს ერთ რიცხვს და საბოლოოდ პასუხად დააბრუნებს ამ რიცხვის კვადრატს. (რიცხვის ხარისხში აყვანის ოპერატორია **)
def square(num):
    return num ** 2



# 6) შექმენით ფუნქცია და გადაეცით ორი რიცხვი პარამეტრებად. ფუქნციამ უნდა დააბრუნოს პირველი რიცხვი აყვანილი მეორე რიცხვის ხარისხში 
def power(base, exponent):
    return base ** exponent



# 7) შექმენით ფუნქცია სახელწოდებით double_values რომელიც არგუმენტად მიიღებს სიას და დააბრუნებს ახალ სიას, სადაც თითოეული ელემენტი გაორმაგებული იქნება.
def double_values(numbers):
    return [num * 2 for num in numbers]



# 8) შექმენით ფუნქცია და გადაეცით არგუმენტად სია. ფუნქციამ უნდა დააბრუნოს ახალი სია, რომლის თითოეული ელემენტიც უნდა იყოს კვადრატში აყვანილი.
def square_elements(numbers):
    return [num ** 2 for num in numbers]



# 9) შექმენით ფუნქცია სახელწოდებით sum, რომელსაც არგუმენტად გადაეცემა 3 რიცხვი და ფუნქციის მიზანი იქნება, რომ ამ სამი რიცხვის ჯამი დააბრუნოს.
def sum(a, b, c):
    return a + b + c




# 10) შექმენით ფუნქცია სახელწოდებით substract, რომელსაც არგუმენტად ორ რიცხვს. ფუნქციამ პასუხად უნდა დააბრუნოს ამ რიცხვების სხვაობა. 
def subtract(a, b):
    return a - b



# 11)  შექმენით ფუნქცია სახელწოდებით multiply, რომელსაც არგუმენტად ორ რიცხვს. ფუნქციამ პასუხად უნდა დააბრუნოს ამ რიცხვების ნამრავლი.
def multiply(a, b):
    return a * b



# 12) შექმენით ფუნქცია სახელწოდებით divide, რომელსაც არგუმენტად ორ რიცხვს. ფუნქციამ პასუხად უნდა დააბრუნოს ამ რიცხვების განაყოფი.
def divide(a, b):
    if b == 0:
        return "Cannot divide by zero"
    return a / b

