# 1) დაწერეთ ფუნქცია, რომელიც მიიღებს რიცხვს და დააბრუნებს მის ორმაგ მნიშვნელობას.


# 2)შექმენით ფუნქცია, რომელსაც არგუმენტად გადასცემთ 3 რიცხვს. ამ ფუნქციამ პასუხად უნდა დააბრუნოს პირველი ორი რიცხვის ჯამი გაყოფილი მესამე რიცხვზე.


# 3) შექმენი ფუნქცია, რომელიც არგუმენტად მიიღებს მასივს და ტერმინალში დაბეჭდავს ყველა ელემენტს.


# 4)თქვენი სიტყვებით ახსენით თუ რა განსხვავებაა print-სა და return keyword-ებს შორის.


# მოცემული დავალებების შესასრულებლად გამოიყენეთ return keyword.

def num(num):
    return num * 2

def divide(a,b,c):
    return (a + b) /c

def list_elements(list):
    for element in list:
        print(element)

    # printით ვაბრუნებთ მნიშვნელობას ტერმინალში
    #რეთურნით ვაბრუნებთ მნიშვნელობას ფუნქციაშ
