# მომხმარებელს შემოატანინეთ მისი ქალაქის, უბნის, კორპუსის და სართულის შესახებ ინფორმაცია
# (რომლებიც უნდა შეინახოთ ცალ-ცალკე ცვლადებში). მაგ. city = "Tbilisi", District = "Gldani" და ა.შ. 
# საბოლოოდ print() ბრძანების საშუალებით ტერმინალში გამოიტანეთ მომხმარებლის სრული მისამართი.

# city = input("enter your city: ")
# house = input("enter your house: ")
# floor = input("enter your floor: ")
# print(f"user lives in {city}. users house is {house}. and the floor is {floor}")


# მომხმარებელს შემოატანინეთ ასაკი და f სტრინგის გამოყენებით დაუბეჭდეთ მსგავსი ფორმატის წინადადება: 
# "You are ასაკი years old".
# user_age = input("please enter your age: ")
# print(f"the user's age is {user_age}.")

#  შექმენით ორი ცვლადი: Num1 და Num2. ორივე ცვლადში შინახეთ input-ი, სადაც
# მომხმარებელმა სასურველი რიცხვები უნდა შემოიტანოს. ამ ოპერაციის დასრულების შემდეგ სცადეთ რომ Num1-სა და Num2-ს შორის 
# განახორციელოთ მათემატიკური ოპერაცია და დააკვირდით ტერმინალში შედეგს. ახსენით თქვენი აზრით რატომ მივიღეთ ასეთი შედეგი.

# num1 = input("enter any number: ")
# num2 = input("enter any number: ")
# print("num1 - num2")
# print("num1 + num2")         I DONT KNOW
# print("num1 * num2")
# print("num1 / num2")




# Paint-ის საშუალებით შექმენით წრიული დიაგრამა, სადაც გექნებათ სამი კატეგორია: 
# Input, Output და საერთო. Input-ში ჩასვით ყველა ის მოწყობილობა, რომლებიც Input-ის
# მაგალითია, Output-ში ის მოწყობილობები ჩასვით, რომლებიც Output-ის მაგალითებია, ხოლო საერთო
# კატეგორიაში ჩაწერეთ მოწყობილობები, რომლებიც როგორც Input-ს ასევე Output-საც ეკუთვნის. 
# (Paint-ში დახატული დიაგრამა დასქრინეთ და გადაიტანეთ Day 08 homework ფოლდერში.)



