# 2) თქვენი სიტყვებით ახსენით:

# • რას ეწოდება ფუნქცია?

# • რისთვის გამოიყენება ფუნქციები Python-ში.

# რას ეწოდება ფუნქცია?
# ფუნქცია არის მრავალჯერადი გამოყენების ბლოკი რომლის მიზანია რომელიმე კონკრეტული ოპერაციის შესრულება.
# რისთვის გამოიყენება ფუნქციები Python-ში.
# ფუნქციებს ვიყენებთ იმისთვის, რომ ყოველ ჯერზე რომ არ ვწეროთ ერთი და იგივე კოდუ და რომ მოკლედ და კონკრეტულად შევასრულოთ მოქმედებები

# ფუნქციები Python-ში გამოყენების მრავალი ხერხი ვიცით:
# str() - გარდაქმით მონაცემის ტიპს string-ად.
# float() - გარდაქმით მონაცემის ტიპს float-ად.
# bool() - განსაზღვრავს True-ს და False-ს
# print() - გამოაქვს ტერმინალში ინფორმაცია
# type() - განსაზღვრავს მონაცემის ტიპს
# input() - მომხმარებელს შემოაქვს ნებისმიერი სახის ინფორმაცია
# range() - თვლის 0-დან მითითებულ რიცვხის ჩათვლით
# int() - გარდაქმით მონაცემის ტიპს integer-ად.

# 3) კომენტარის სახით დაწერეთ, რას ეწოდება არგუმენტი. როგორც გაკვეთილზე ავხსენით ნახაზის საშუალებით - ასევე თქვენც გევალებათ, რომ Paint-ში ახსნათ ფუნქციის სინტაქსი და მისი არგუმენტები.
# არგუმენტი არის ის მნიშვნელობა რაც გადაეცემა ფუნქციას
# არსებობს ორი სახის ფუნქციები: რომლებისთვისაც სავალდებულოა არგუმენტი და რომლისთვისაც არა
# ფუნქციები Python-ში გამოყენების მრავალი ხერხი ვიცით:

# input() - მომხმარებელს შემოაქვს ნებისმიერი სახის ინფორმაცია
# range() - თვლის 0-დან მითითებულ რიცვხის ჩათვლით
# type() - განსაზღვრავს მონაცემის ტიპს
# int() - გარდაქმით მონაცემის ტიპს integer-ად.
# str() - გარდაქმით მონაცემის ტიპს string-ად.
# float() - გარდაქმით მონაცემის ტიპს float-ად.
# bool() - განსაზღვრავს True-ს და False-ს
# print() - გამოაქვს ტერმინალში ინფორმაცია

# 4) შექმენით ისეთი სია, სადაც შეინახავთ ყველა ნასწავლ მონაცემთა ტიპს ორ-ორჯერ, რომლებსაც მოათავსებთ სხვადასხვა ინდექსებზე. ბოლოს ინდექსინგის საშუალებით გამოიტანეთ მხოლოდ Boolean მნიშვნელობები.
# list =  ["IURI", 62, "nigerian", True, 16, "person", 122.198, False]

# print(list[3], list[-1])

# 5) შექმენთი სია [2, 4, 6, 8, 10].
# გადაუარეთ for ციკლით და სიის ელემენტების გაორმაგებული მნიშვნელობები ეკრანზე დაბეჭდეთ.
# list = [2, 5, 8, 0, 13, 1314, 14, 87, 45]

# for i in list:
#     ori = i * 2
#     print(ori)

# 6) იპოვეთ და დაბეჭდეთ 1-დან 100-მდე რიცხვების თანმიმდებრობიდან მხოლოდ ის რიცხვები, რომლებიც იყოფა 5-ზე.
# for i in range(100):
#     if i % 5 == 0:
#         print(i)

# 7) დაწერეთ პროგრამა, სადაც მომხმარებელს შემოატანინებთ რიცხვებს მანამ, სანამ ის არ შეიყვანს 0-ს. ბოლოს დაბეჭდეთ ყველა მცდელობაზე შემოტანილი რიცხვების ჯამი.
# number = 0
# num = int(input("Enter your number: "))

# while num != 0:
#     print("incorrect")

#     num = int(input("Enter your number: "))

#     number += num

# print(num)
# print(number)

# 8) while loop-ის გამოყენებით იპოვეთ და დაბეჭდეთ 1-დან 30-მდე მხოლოდ ლუწი რიცხვები.
# i = 1

# while i <= 30:
#     if i % 2 == 0:
#         print(i)
#     i += 1
# 9) დაწერეთ პროგრამა, სადაც მომხმარებელს აარჩევინებთ ნებისმიერ სტრინგს, შემდეგ კი მოცემული სტრინგიდან მხოლოდ კენტ ინდექსზე მდგომ ელემენტებს გამოიტანს ტერმინალში.
# string = input("Enter your word: ")

# print(string[0::3])

# 10) დაწერეთ პროგრამა, რომელიც შეადარებს მომხმარენლის მიერ შემოტანილ ორ რიცხვს და დაბეჭდავს, რომელი უფრო მეტია ან ტოლია.
# num1 = int(input("Enter your first number: "))
# num2 = int(input("Enter your second number: "))

# if num1 < num2:
#     print("first number is less")
# elif num1 > num2:
#     print("first number is more")
# else:
#     print("they are equal")

# 11) მომხმარებელს შემოატანინეთ ასაკი. გამოიყენეთ პირობითი განცხადებები რომ შექმნათ პროგრამა, სადაც - იმ შემთხვევაში თუ User იქნება 13 წელზე ნაკლენბი ასაკის გამოიტანთ 'You are a child'. თუ იქნება 13 წელზე მეტი, მაგრამ 18-ზე ნაკლები ასაკის დაუბეჭდეთ 'You are a teen'. თუ 18 წელზე მეტის იქნება დაუბეჭდეთ 'You are an adult.'
# age = int(input("Enter your age: "))

# if age < 13:
#     print("You are a child")
# elif age >= 13 and age < 18:
#     print("You are a teen")
# else:
#     print("You are an adult")