# ჩამოწერეთ პირობითი განცხადებების შემადგენელი ყველა Keyword-ი, თითოეულს თან დაურთეთ განმარტება და თქვენი სიტყვებით ახსენით თუ რატომ/რა შემთხვევებში არის elif keyword-ი საჭირო.
# Keywords: if, else, elif
# if - გამოიყენება პირობითი განცხადების დასაწყებად. თუ პირობა ჭეშმარიტია, შესრულდება if-ის ბლოკი.
# else - გამოიყენება, როდესაც if-ის პირობა არ არის ჭეშმარიტი. else-ის ბლოკი შესრულდება, თუ if-ის პირობა არ შესრულდა.
# elif - გამოიყენება, როდესაც გვინდა დავამატოთ დამატებითი პირობა, რომელიც შეამოწმებს თუ სხვა შესაძლო ვარიანტებს, თუ if-ის პირობა არ შესრულდა.
# ცვლადში შეინახეთ თქვენი ასაკი. შემდეგ მომხმარებელს შემოატანინეთ თავისი ასაკი. თუ თქვენი გვარები დაემთხვევა გამოიტანეთ "We are the same age", სხვა შემთხვევაში - "We are not the same age".
# my_age = 15  # ჩემი ასაკი
# user_age = int(input("Enter your age: "))  # მომხმარებლის ასაკი
# if user_age == my_age:  # თუ მომხმარებლის ასაკი ემთხვევა ჩემსას
#     print("We are the same age")  # გამოტანა, რომ ჩვენ ერთი ასაკის ვართ
# else:
#     print("We are not the same age")
#  დააკვირდით მოცემულ flowchart-ს, ახსენით მისი მუშაობის პრინციპი. მისი მიხედვით Vscode-ში დაწერეთ პროგრამა და
# აღწერეთ რა შედეგს გამოიტანს კოდი იმ შემთხვევაში,
# როდესაც მომხმარებელი არის 14 წლის და არ არის სტუდენტი.
# Flowchart-ის მიხედვით, პროგრამა შეამოწმებს მომხმარებლის ასაკს და სტუდენტობის სტატუსს.
# თუ მომხმარებელი 14 წლის და არ არის სტუდენტი, პროგრამა დაბეჭდავს-10%discount.
# 5) დაწერეთ პროგრამა, რომელიც მომხმარებლს მოსთხოვს, რომ შემოიტანოს დადებითი რიცხვი. 
# თუ მომხმარებელი შემოიტანს უარყოფით რიცხვს ან ნულს, პროგრამამ უნდა მოსთხოვოს რიცხვის თავიდან შემოტანა
# useris_ricxviii = int(input("Please enter a positive number: "))
# while useris_ricxviii <= 0:
#     print("axlidan.")
#     useris_ricxviii= int(input("Please enter a positive number: "))
# print(f"You entered a positive number: {useris_ricxviii}")