# დაწერეთ პროგრამა, რომელიც გამოიტანს რიცხვებს 50-დან 200-მდე for loop-ის გამოყენებით.
# for number in range(50, 201):
#     print(number)

# დაწერეთ პროგრამა, რომელიც გამოიტანს ყველა ლუწ რიცხვს 1-დან 100-ის ჩათვლით for loop-ის გამოყენებით.
# for number in range(2, 101, 2):
#         print(number)

# დაწერეთ პროგრამა, რომელიც გამოიტანს ყველა კენტ რიცხვს 100-დან 150-მდე for loop-ის გამოყენებით.
# for number in range(99, 151, 2):
#     print(number)
#  დაწერეთ პროგრამა, რომელიც გამოიტანს რიცხვებს 1-დან 50-ის ჩათვლით while loop-ის გამოყენებით.
# x = 1
# while x <= 49:
#         x += 1
#         print(x)

# დაწერეთ პროგრამა, რომელიც გამოიტანს რიცხვებს 20-დან 60-ის ჩათვლით, 5-ის გამოტოვებით while loop-ის გამოყენებით.
# x = 20
# while x <= 55:
#     x += 5
#     print(x)
