#ხსენით თუ რისთვის არის საჭირო კარგი პრაქტიკების გამოყენება კოდის წერის დროს;
#კოდის წერისას კარგი პრაქტიკაა კომენტარის მიწერა და snake_case/camelCase და ესენი ჩვენ გვეხმარება Teamwork-ში და რამდენიმე ხნის მერე რო
#  ვნახოთ ჩვენი კოდი მარტივად რომ გავიგოთ ჩვენი თითოეული კოდის აზრი


# შექმენით ორი ცვლადი და მათში შეინახეთ რიცხვები. შეასრულეთ ყველა ის მათემატიკური 
# ოპერაცია, რაც აქამდე ვისწავლეთ და თითოეული ეს ოპერაცია შეინახეთ ცვლადებში. საბოლოოდ დაბეჭდეთ ამ ცვლადის მნიშვნელობები.
#  რაც ყველაზე მთავარია -
#  ამ დავალების შესრულებისას, თითოეულ ხაზზე კომენტარიებით უნდა ახსნათ თუ რა მოქმედებებს ასრულებთ.
# num1 = 10 # პირველი ცვლადი
# num2 = 20 #მეორე ცვლადი
# print(num1 - num2) #გამოკლება
# print(num1 + num2) #მიმატება
# print(num1 * num2) #გამრავლება
# print(num1 / num2) #გაყოფა
# num1 = -10 #განახლებული პირველი ცვლადი
# num2 = 30 #განალებული მეორე ცვლადი
# num3 = 200 #მესამე ცვლადი
# num4 = 0.5 #მეოთხე ცვლადი
# print(num1,  num2, num3, num4 ) # გამომაქ ყველაფერი ტერმინალში

#გაასწორეთ მოცემული კოდები:

#1. first_user = "Lika"  first_user = "Lika"
#2nduser = "Giorgi"    second_user = "Giorgi"
#print(first user)    print(first_user)

# 2. first name = Data  first_name = "Data"
# last % name = "random"  lastName = "random"

# 3. რას გამოიტანს ეს კოდი?
# Num1 = 20
# num2 = 30
# print(num1 + num2) error-ს რადგან პრინტშა შეცდომა Num1
# შედეგი ახსენით კომენტარებით.



