# 2) მოცემულია სია:

nums = [10, 20, 30, 40, 50, 60]

# დაბეჭდეთ: სიის პირველი ელემენტი, ბოლო ელემენტი და საბოლოოდ რიცხვები 30, 40.
# print(nums[0])  # პირველი ელემენტი
# print(nums[-1])  # ბოლო ელემენტი
# print(nums[2:4])  # რიცხვები 30, 40


# 3) შექმენით ცვლადი word = "Programming" და დაბეჭდეთ ცვლადის:
word = "Programming"

#     • პირველი ასო
print(word[0])  # პირველი ასო

#     • ბოლო ასო
print(word[-1])  # ბოლო ასო

#     • "gram" slicing-ით
print(word[3:7])  # "gram" slicing-ით

#     • სიტყვა შებრუნებულად
print(word[::-1])  # სიტყვა შებრუნებულად

# 4) მომხმარებელს შემოატანინე წინადადება input-ის გამოყენებით, ტერმინალში კი დაბეჭდე ჯერ ამ წინადადების პირველი ასოს და ბოლო ასოს ნაერთი. ბოლოს ეს მთლიანი წინადადება დაბეჭდეთ ტერმინალში უკუღმა.
user_input = input("შეიყვანეთ წინადადება: ")
first_last_combined = user_input[0] + user_input[-1]  # პირველი და ბოლო ასოს ნაერთი
print(first_last_combined)  # დაბეჭდეთ პირველი და ბოლო ასოს ნაერთი
print(user_input[::-1])  # წინადადება უკუღმა    


# 5) შექმენით სია [1, 2, 3, 4, 5].
# მომხმარებელს შეეკითხეთ ჯერ რომელ ინდექსზე სურს ელემენტის ჩანაცვლება, შემდეგ თუ რა ელემენტით უნდა ამ კონკრეტულ ინდექსზე მყოფი რიცხვის ჩანაცვლება და ამის მიხედვით შეცვალეთ სია. სიის თავდაპირველი და ბოლო სახეები გამოიტანეთ ტერმინალში.
my_list = [1, 2, 3, 4, 5]
index_to_replace = int(input("შეიყვანეთ ინდექსი, რომლის ჩანაცვლებაც გსურთ: "))
new_value = int(input("შეიყვანეთ ახალი მნიშვნელობა: "))
my_list[index_to_replace] = new_value  # ჩანაცვლება
print("სიის თავდაპირველი სახე:", [1, 2, 3, 4, 5])  # თავდაპირველი სია
print("სიის ბოლო სახე:", my_list)  # განახლებული სია   


# 6) შექმენით სია და შეამოწმეთ, არის თუ არა ის სიმეტრიული (მაგ: [1, 2, 3, 2, 1]).


# # Output: "Symmetric" ან "Not symmetric"
my_list = [1, 2, 3, 2, 1]
if my_list == my_list[::-1]:  # შეამოწმეთ სიმეტრია
    print("Symmetric")  # თუ სიმეტრიულია
else:
    print("Not symmetric")

# hint: დაგჭირდებათ Slicing.

# 7) შექმენი რიცხვების სია, სადაც დაამატებთ 8 რიცხვს. ცალკეულ ცვლადებში შეინახეთ ამ სიის საშუალო არითმეტიკული და სიის რიცხვების ჯამი. ბოლოს f string-ის გამოყენებით გამოიტანეთ მსგავსი წინადადებები:

# The aritchmetic mean of this list is: ...
# The sum of all numbers in this list is: ...
