# 1) შექმენით items ცვლადი, რომელშიც შინახავთ მინიმუმ 10 ტექნიკას (მაგ. კომპიუტერი, მიკროფონი, ა.შ). გამოიტანეთ Items სიიდან ყოველი მეოთხე ელემენტი Slicing-ის გამოყენებით.
items = ["კომპიუტერი", "მიკროფონი", "ტელეფონი", "ტელევიზორი","კამერა", "სპიკერი", "პროექტორი", "სმარტფონი""ლეპტოპი", "ტაბლეტი"]
print(items[::4])  # გამოაქვს ყოველი მეოთხე ელემენტი
# 2) ცვლადში შეინახეთ თქვენი სახელი და გვარი, ჯერ დაბეჭდეთ ტავდაპირველი ვერსია, შემდეგ კი შებრუნებული.
name = "იური იმერლიშვილი"
print(name)  # თავდაპირველი სახელი
print(name[::-1])  # შებრუნებული სახელი
# 3) შექმენით Fruits ცვლადი და შეინახეთ მასში მინიმუმ 7ც ხილი. შეაბრუნეთ Fruits სია, შემდეგ Slicing-ის გამოყენებით გამოიტანეთ სიის ბოლო 3 ელემენტი.
fruits = ["ვაშლი", "ნარინჯი", "ბანანი", "მსხალი", "კივი", "მარწყვი", "ანანასი"]
fruits.reverse()  # Fruits სიის შებრუნება
print(fruits[-3:])  # ბოლო 3 ელემენტის გამოტანა
# 4) რას ეწოდება Slicing? ახსენით დეტალურად კომენტარებით. ამასთანავე ახსენით Slicing-ის სინტაქსი (პლიუს start, stop, step როგორ მუშაობს)
# Slicing არის სიის ან სტრინგის ნაწილის ამოღების მეთოდი, რომელიც საშუალებას გვაძლევს მივიღოთ ელემენტების სუბსეტი. Slicing-ის სინტაქსი არის: `sequence[start:stop:step]`, სადაც:
# start სიის ან სტრინგის ნაწილის დაწყების ინდექს
# stop სიის ან სტრინგის ნაწილის დასრულების ინდექს (არ შედის შედეგში)
# step ნაბიჯი, რომელიც განსაზღვრავს, რამდენი ელემენტი უნდა გამოტოვდეს თითოეულ ნაბიჯზე
# 5) მოიყვანეთ მაგალითი თუ რატომ არის სტრინგი შუცვლელიმონაცემის ტიპი და თუ რატომაა სია შეცვლადი.
# სტრინგი არის შეუცვლელი მონაცემის ტიპი, რადგან მასში არსებული სიმბოლოების შეცვლა შეუძლებელია. მაგალითად, თუ გვინდა სტრინგში არსებული სიმბოლოების შეცვლა, უნდა შევქმნათ ახალი სტრინგი.